//Представьте, что вы пишите программу для онлайн кинотеатра.
// У вас известно возрастное ограничение  фильма и возраст клиента (естественно заданы в виде переменных).
// Ваша программа должна  выдавать на экран: «вы можете смотреть этот фильм» или «данный контент вам не доступен»

public class Main {
    public static void main(String[] args) {
        int age = 12;
        int ageLimit = 16;

        if(age>=ageLimit){
            System.out.println("вы можете смотреть этот фильм");
        } else {
            System.out.println("данный контент вам не доступен");
        }
        System.out.println("возрастное ограничение  фильма "+ ageLimit +"+");

    }
}