//Представьте, Вы пишите программу  для расчета штрафов за превышение скорости.
// В качестве исходных данных у вас: ограничение скорости на данном участке дороги,
//скорость, с которой двигался автомобиль и признак того, что нарушение было совершено на автобане.
// Естественно, все три значения заданы переменными. Таблица штрафов такая:
//
//        превышение менее 10% от скоростного ограничения – не штрафуется
//
//        10% - менее 20%   от скоростного ограничения – 50 евро
//
//        20% - менее 30%   от скоростного ограничения – 150 евро не на автобане, и 200 на автобане
//
//        от 30% и выше  - 500евро плюс, если нарушение на автобане, лишение прав на 3 месяца.
//        Реализуйте программу, которая рассчитывает штраф и выводит соответствующее сообщение на экран.

public class Main {
    public static void main(String[] args) {
        double speedLimit = 120;
        double autoSpeed = 170;
        boolean autobahn = false;
        double deviation = ((100 * autoSpeed / speedLimit) - 100);
        int fine = 0;

        if (deviation < 10) {
            fine = 0;
        }
        if (deviation >= 10 && deviation < 20) {
            fine = 50;
        }
        if (deviation >= 20 && deviation < 30) {
            fine = 150;
        }
        if (deviation >= 20 && deviation < 30 && autobahn) {
            fine = 200;
        }
        if (deviation >= 30) {
            fine = 500;
        }
        if (deviation >= 30 && autobahn) {
            fine = 500;
            System.out.println("Лишение прав на 3 месяца и");
        }

        System.out.println("штраф: " + fine + " Euro");

    }


}